Revit 2024 API
ReinforcementRoundingSource Enumeration
 An enumerated type listing the possible sources for reinforcement rounding overrides.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Since: 2014
Syntax
C#
public enum ReinforcementRoundingSource
Visual Basic
Public Enumeration ReinforcementRoundingSource
Visual C++
public enum class ReinforcementRoundingSource
Members
Member name | Description
None |  No rounding overrides are in use.
ReinforcementSettings |  Rounding overrides from the ReinforcementSettings are in use.
Type |  Rounding overrides from the rebar types or fabric types are in use.
Element |  Rounding overrides from Rebar or RebarInSystem or FabricSheet or FabricArea instances are in use.
See Also
Autodesk.Revit.DB.Structure Namespace